#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ssm_parameter.foo: Refreshing state... [id=foo]
aws_vpc.main: Refreshing state... [id=vpc-0019a2de5322a3397]
aws_iam_role.role-launch-ec2: Refreshing state... [id=role-launch-ec2]
data.aws_availability_zones.all: Reading...
data.aws_availability_zones.all: Read complete after 0s [id=us-east-1]
aws_iam_instance_profile.ec2-instance-profile: Refreshing state... [id=ec2_instance_profile]
aws_internet_gateway.igw: Refreshing state... [id=igw-0ac123e9b2f9f6dc9]
data.aws_subnet_ids.public_subnets: Reading...
aws_subnet.private-subnet[0]: Refreshing state... [id=subnet-098d6efe9b7c412e0]
aws_subnet.private-subnet[5]: Refreshing state... [id=subnet-0a30a8a1ceddedc4d]
aws_subnet.public-subnet[3]: Refreshing state... [id=subnet-0086c7e08f9686a98]
aws_subnet.private-subnet[4]: Refreshing state... [id=subnet-04515c5c0cc6a3b7c]
aws_subnet.private-subnet[1]: Refreshing state... [id=subnet-04dbb45a2d8b3f2b0]
aws_security_group.sg: Refreshing state... [id=sg-0ecf005d25660f34a]
aws_subnet.private-subnet[2]: Refreshing state... [id=subnet-04907e983cda8b829]
aws_subnet.private-subnet[3]: Refreshing state... [id=subnet-0913fab23c6fc946e]
aws_subnet.public-subnet[4]: Refreshing state... [id=subnet-08e6078c1c8efdfdd]
data.aws_subnet_ids.public_subnets: Read complete after 1s [id=vpc-0019a2de5322a3397]
aws_subnet.public-subnet[1]: Refreshing state... [id=subnet-084b421443cfcb750]
aws_subnet.public-subnet[0]: Refreshing state... [id=subnet-0a038ffe273e528cf]
aws_subnet.public-subnet[5]: Refreshing state... [id=subnet-0b6f663793f911886]
aws_subnet.public-subnet[2]: Refreshing state... [id=subnet-02d15ccd3b52e5319]
aws_route.public_subnets_igw[2]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[5]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[4]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[0]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[1]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[3]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_launch_configuration.alc: Refreshing state... [id=terraform-20230206200824630000000001]
aws_instance.ec2_instance[0]: Refreshing state... [id=i-007191799580abcdf]
aws_instance.ec2_instance[1]: Refreshing state... [id=i-0d4aea6a949ed51d1]
aws_route_table_association.public_subnets_association[5]: Refreshing state... [id=rtbassoc-0802b8fa82971a529]
aws_route_table_association.public_subnets_association[2]: Refreshing state... [id=rtbassoc-0e0468fb16730045c]
aws_route_table_association.public_subnets_association[3]: Refreshing state... [id=rtbassoc-0e0f58fc63e546404]
aws_route_table_association.public_subnets_association[0]: Refreshing state... [id=rtbassoc-008c4bd80a2938c9f]
aws_route_table_association.public_subnets_association[4]: Refreshing state... [id=rtbassoc-0a29256b27cc8d765]
aws_route_table_association.public_subnets_association[1]: Refreshing state... [id=rtbassoc-0fac2590760fc4c4b]
aws_autoscaling_group.asg: Refreshing state... [id=terraform-20230206200825520100000002]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_autoscaling_group.asg has changed
  ~ resource "aws_autoscaling_group" "asg" {
        id                        = "terraform-20230206200825520100000002"
      + name                      = "terraform-20230206200825520100000002"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_instance.ec2_instance[1] has changed
  ~ resource "aws_instance" "ec2_instance" {
        id                                   = "i-0d4aea6a949ed51d1"
        tags                                 = {
            "Environment" = "Production"
            "Name"        = "remix-recipe-prod-instance-2"
            "Owner"       = "Shubham"
        }
        # (28 unchanged attributes hidden)

      ~ root_block_device {
          + tags                  = {}
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_elb will be created
  + resource "aws_autoscaling_attachment" "asg_elb" {
      + autoscaling_group_name = "remix-recipe-prod-asg"
      + elb                    = "remix-recipe-server-elb"
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.asg is tainted, so must be replaced
-/+ resource "aws_autoscaling_group" "asg" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:619568494776:autoScalingGroup:f3e588c4-cad9-4b1a-b1ca-29be9ac86509:autoScalingGroupName/terraform-20230206200825520100000002" -> (known after apply)
      - capacity_rebalance        = false -> null
      ~ default_cooldown          = 300 -> (known after apply)
      - enabled_metrics           = [] -> null
      ~ health_check_type         = "EC2" -> (known after apply)
      ~ id                        = "terraform-20230206200825520100000002" -> (known after apply)
      ~ launch_configuration      = "terraform-20230206200824630000000001" -> "remix-recipe-prod-lc"
      - load_balancers            = [] -> null
      - max_instance_lifetime     = 0 -> null
      ~ name                      = "terraform-20230206200825520100000002" -> "remix-recipe-prod-asg"
      ~ name_prefix               = "terraform-" -> (known after apply)
      ~ service_linked_role_arn   = "arn:aws:iam::619568494776:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes       = [] -> null
      - target_group_arns         = [] -> null
      - termination_policies      = [] -> null
      ~ vpc_zone_identifier       = [] -> (known after apply)
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_elb.elb will be created
  + resource "aws_elb" "elb" {
      + arn                         = (known after apply)
      + availability_zones          = (known after apply)
      + connection_draining         = false
      + connection_draining_timeout = 300
      + cross_zone_load_balancing   = true
      + desync_mitigation_mode      = "defensive"
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 60
      + instances                   = [
          + "i-007191799580abcdf",
          + "i-0d4aea6a949ed51d1",
        ]
      + internal                    = false
      + name                        = "remix-recipe-server-elb"
      + security_groups             = (known after apply)
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = [
          + "subnet-04515c5c0cc6a3b7c",
          + "subnet-04907e983cda8b829",
          + "subnet-04dbb45a2d8b3f2b0",
          + "subnet-0913fab23c6fc946e",
          + "subnet-098d6efe9b7c412e0",
          + "subnet-0a30a8a1ceddedc4d",
        ]
      + tags                        = {
          + "Environment" = "Production"
          + "Name"        = "remix-recipe-server-elb"
          + "Owner"       = "Shubham"
        }
      + tags_all                    = {
          + "Environment" = "Production"
          + "Name"        = "remix-recipe-server-elb"
          + "Owner"       = "Shubham"
        }
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = 2
          + interval            = 30
          + target              = "HTTP:80/"
          + timeout             = 3
          + unhealthy_threshold = 5
        }

      + listener {
          + instance_port     = 80
          + instance_protocol = "http"
          + lb_port           = 80
          + lb_protocol       = "http"
        }
    }

  # aws_iam_instance_profile.ec2-instance-profile must be replaced
-/+ resource "aws_iam_instance_profile" "ec2-instance-profile" {
      ~ arn         = "arn:aws:iam::619568494776:instance-profile/ec2_instance_profile" -> (known after apply)
      ~ create_date = "2023-02-05T17:57:03Z" -> (known after apply)
      ~ id          = "ec2_instance_profile" -> (known after apply)
      ~ name        = "ec2_instance_profile" -> "remix-recipe-ec2-instance-profile" # forces replacement
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
      ~ unique_id   = "AIPAZAQJI7C4KQQPZHYMY" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_instance.ec2_instance[0] will be updated in-place
  ~ resource "aws_instance" "ec2_instance" {
      ~ iam_instance_profile                 = "ec2_instance_profile" -> "remix-recipe-ec2-instance-profile"
        id                                   = "i-007191799580abcdf"
        tags                                 = {
            "Environment" = "Production"
            "Name"        = "remix-recipe-prod-instance-1"
            "Owner"       = "Shubham"
        }
      ~ vpc_security_group_ids               = [
          - "sg-0ecf005d25660f34a",
        ] -> (known after apply)
        # (26 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_instance.ec2_instance[1] will be updated in-place
  ~ resource "aws_instance" "ec2_instance" {
      ~ iam_instance_profile                 = "ec2_instance_profile" -> "remix-recipe-ec2-instance-profile"
        id                                   = "i-0d4aea6a949ed51d1"
        tags                                 = {
            "Environment" = "Production"
            "Name"        = "remix-recipe-prod-instance-2"
            "Owner"       = "Shubham"
        }
      ~ vpc_security_group_ids               = [
          - "sg-0ecf005d25660f34a",
        ] -> (known after apply)
        # (26 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_launch_configuration.alc must be replaced
-/+ resource "aws_launch_configuration" "alc" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:619568494776:launchConfiguration:2c026d4d-5c52-4b49-8fb9-e4723e0b4c94:launchConfigurationName/terraform-20230206200824630000000001" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "terraform-20230206200824630000000001" -> (known after apply)
      + key_name                         = (known after apply)
      ~ name                             = "terraform-20230206200824630000000001" -> "remix-recipe-prod-lc" # forces replacement
      ~ name_prefix                      = "terraform-" -> (known after apply)
      ~ security_groups                  = [
          - "sg-0ecf005d25660f34a",
        ] -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (4 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.sg must be replaced
-/+ resource "aws_security_group" "sg" {
      ~ arn                    = "arn:aws:ec2:us-east-1:619568494776:security-group/sg-0ecf005d25660f34a" -> (known after apply)
      ~ id                     = "sg-0ecf005d25660f34a" -> (known after apply)
      ~ name                   = "remix-recipe-nginx-security-group" -> "remix-recipe-security-group" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "619568494776" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @shubhamcommits, Action: `pull_request`*